[
  {
    "title": "Hyrule Field",
    "pieces": [
      {
        "number": 15,
        "img": "Zelda05/HeartPieces/HP15.jpg",
        "directions": "\n\tIn the southwest corner of Hyrule Field is the entrance to Lake Hylia. Just \n\tbefore the entrance itself is four fences that form a square. Lay a bomb in \n\tthe center to reveal a hole. Jump down and buy the Piece of Heart from the \n\tBusiness Scrub for 10 Rupees. What a deal!"
      },
      {
        "number": 26,
        "img": "Zelda05/HeartPieces/HP26.jpg",
        "directions": "\n\tNorth of Lon Lon Ranch (between Gerudo Valley and Hyrule Castle) there is a \n\ttree. Place a bomb next to it to reveal a hole. Inside, use either the Iron \n\tBoots or the Gold Scale to dive deep into the water and retrieve this Piece \n\tof Heart."
      }
    ]
  },
  {
    "title": "Market",
    "pieces": [
      {
        "number": 8,
        "img": "Zelda05/HeartPieces/HP08.jpg",
        "directions": "\n\tDuring the day, the Bombchu Bowling Alley is open and ready for business! \n\tThe game cycles through five different prizes, in this order: Bombchus, \n\tPiece of Heart, Bombs, Bomb Bag, Purple Rupee (50). If you mess up playing \n\tthe game for the prize you want, you'll have to wait for the prize to cycle \n\taround again. Aww!"
      },
      {
        "number": 9,
        "img": "Zelda05/HeartPieces/HP09.jpg",
        "directions": "\n\tDuring the night, there are lots of dogs roaming the streets. If you touch \n\tone, it will follow you until you enter a building or leave the area \n\tentirely. There is one specific dog we want, which is the white one behind \n\tthe booth just to the left of the exit leading back to Hyrule Field. Make it \n\tfollow you, then head over to the right a bit and enter the Back Alley \n\tbetween the buildings. Enter the door straight ahead to your left, which is \n\tthe only one open at night. Inside, you'll find a rather large woman wearing \n\ta blue dress who is constantly raving about her \"Little Richard\" during the \n\tday. For bringing him back, she'll gift you with a Piece of Heart. Score!"
      },
      {
        "number": 33,
        "img": "Zelda05/HeartPieces/HP33.jpg",
        "directions": "\n\tThe Treasure Chest Shop is open only at night. Enter and you can play this \n\tgame for 10 Rupees a try. In each room, you are given a choice between two \n\tchests, one being a prize while the other allows you to move forward to \n\tbetter prizes. It's a fifty-fifty chance you'll make it each time, so your \n\tchances of doing it on your own... aren't that good... Once you have \n\tacquired the Lens of Truth, you can use it during the game (there's a sign \n\tout front that says no lenses are allowed, teehee!) in order to see what's \n\tinside the chests. Pick all the Small Key chests to get to the end."
      }
    ]
  },
  {
    "title": "Lon Lon Ranch",
    "pieces": [
      {
        "number": 2,
        "img": "Zelda05/HeartPieces/HP02.jpg",
        "directions": "\n\tDuring the past, go to Lon Lon Ranch and enter the storage building in the \n\tback of the ranch. Pull the boxes back to reach the far corner where you'll \n\tfind a hole you can crawl through. This leads to a little area with a Piece \n\tof Heart in a nest. Apparently birds can lay hearts?"
      }
    ]
  },
  {
    "title": "Lost Woods",
    "pieces": [
      {
        "number": 3,
        "img": "Zelda05/HeartPieces/HP03.jpg",
        "directions": "\n\tWhen you enter the lost woods as a child, go right one screen then jump down \n\tinto the lower area. Stand on the stump off to the right to make two Skull \n\tKids appear. Pull out your Ocarina and they'll let you play along with their \n\tsongs. It's essentially a game of Simon Says, and if you can manage to play \n\tthree of their songs in a row (that steadily get more difficult), they'll \n\tgift you with a Piece of Heart."
      },
      {
        "number": 4,
        "img": "Zelda05/HeartPieces/HP04.jpg",
        "directions": "\n\tEnter the Lost Woods as a child and go left one screen. Stand on the stump, \n\tpull out your Ocarina and play Saria's Song once you've acquired it. The \n\tSkull Kid on top of the tree trunk in front of you will get excited and \n\toffer you a Piece of Heart for his new friend. That's the sign of a true \n\tfriend!"
      }
    ]
  },
  {
    "title": "Kakariko Village",
    "pieces": [
      {
        "number": 7,
        "img": "Zelda05/HeartPieces/HP07.jpg",
        "directions": "\n\tTo get this Piece of Heart, you need to get on top of Impa's House (the \n\tbuilding to the far southwest). You can get there by either catching a ride \n\tfrom the Owl atop Death Mountain as a child, or using the Hookshot as an \n\tadult to get on top of the House of Skulltula, then on top of Impa's House.\n\tOnce you get up there, jump off to the east side where there's a ledge above \n\tthe fence. Enter the hole in the wall which takes you into a cage inside the \n\thouse with a cow...? and a Piece of Heart!"
      },
      {
        "number": 19,
        "img": "Zelda05/HeartPieces/HP19.jpg",
        "directions": "\n\tWithin the Windmill is a ledge with a Piece of Heart resting atop it. You \n\tcan either use the Boomerang as a child to bring it down, or you can race \n\tagainst Dampe in the Graveyard as an adult, then jump across the moving \n\tplatforms to get it."
      },
      {
        "number": 20,
        "img": "Zelda05/HeartPieces/HP20.jpg",
        "directions": "\n\tOnce you have collected 50 Gold Skulltulas go into the House of Skulltulas \n\tand claim your prize."
      },
      {
        "number": 30,
        "img": "Zelda05/HeartPieces/HP30.jpg",
        "directions": "\n\tWhen you are an adult, use the Longshot to get onto the roof of granny's \n\tpotion shop and then talk to the guy up there and he will give you the Peice \n\tof Heart. You can also barely reach it with the Hookshot while standing next \n\tto the windmill.\n\tAnother way, (cheater...) is to get on top of the lookout tower, face to the \n\tsouth, Z-target, and side jump to the left. This will cause you to land on \n\ttop of the fence, which you can then use to climb up. You can do this to get \n\tthis Piece of Heart WAY early."
      }
    ]
  },
  {
    "title": "Graveyard",
    "pieces": [
      {
        "number": 1,
        "img": "Zelda05/HeartPieces/HP01.jpg",
        "directions": "\n\tGo up to the giant tombstone (Royal Family's Tomb) and turn back to the \n\texit. There are five tombstones on your left side directly in front of you. \n\tThe second from the right can be pulled back. Do so and drop down into the \n\thole to find a ReDead. Defeat it (freeze it first with the Sun's Song), then \n\tstand on the steps and play the Sun's Song (again) to make a chest appear \n\tcontaining a Piece of Heart."
      },
      {
        "number": 14,
        "img": "Zelda05/HeartPieces/HP14.jpg",
        "directions": "\n\tOnce you have a lot of Rupees to throw around, enter the Graveyard between \n\t18:00 and 21:00 (you can talk to the guard at the entrance of Kakariko to \n\tcheck the time). You will have the option of playing Dampe's Heart-Pounding \n\tGrave Digging Tour for 10 Rupees a try. Speak to him when he's standing in \n\tfront of a patch of soft soil, pay up, and see what you find. Mostly, you \n\tfind nothing, but occasionally you get Rupees. Eventually, you will find a \n\tPiece of Heart. Unfortunately, it's completely random, so you could end up \n\tbeing here awhile... *cries*"
      },
      {
        "number": 18,
        "img": "Zelda05/HeartPieces/HP18.jpg",
        "directions": "\n\tOn the left side of the Graveyard as a child, there is a soft soil location. Plant a \n\tMagic Bean and return as an adult later on. Ride the Magic Bean Plant up \n\tonto the ledge and roll into the crate to find a Piece of Heart."
      },
      {
        "number": 29,
        "img": "Zelda05/HeartPieces/HP29.jpg",
        "directions": "\n\tOnce you've acquired the Hookshot, you can race against Dampe again anytime \n\tyou like. If you can beat him in under a minute, you'll get a Piece of \n\tHeart. Perhaps the most successful way of doing this is to use the Longshot, \n\tonce you have it, to latch onto the torch near the end of the maze, shaving \n\ta few seconds off your travels."
      }
    ]
  },
  {
    "title": "Death Mountain Trail",
    "pieces": [
      {
        "number": 21,
        "img": "Zelda05/HeartPieces/HP21.jpg",
        "directions": "\n\tAs a child, plant a Magic Bean in the soft soil at the entrance of Dodongo's \n\tCavern. When you return as an adult, you can ride the Magic Bean Plant to \n\tjump onto the ledge just above Dodongo's Cavern where a Piece of Heart \n\tawaits.\n\tAnother way to get there is to go to the Bomb Flowers directly above as a \n\tchild. Move the Bomb Flower out of the way, then face away towards the \n\tsoutheast (opposite the cavern), Z-target and backflip. If done right, \n\tyou'll land on the platform and can get the Piece of Heart early."
      }
    ]
  },
  {
    "title": "Goron City",
    "pieces": [
      {
        "number": 5,
        "img": "Zelda05/HeartPieces/HP05.jpg",
        "directions": "\n\tAt the lowest level of the city, light all of the torches using Deku Sticks \n\t(and the lit torch in Darunia's chamber) or Din's Fire. Once all of them are \n\tlit, the giant goron-faced urn in the center will begin spinning. Go up to \n\tthe second floor where you can toss either Bomb Flowers or Bombs into it \n\tonce it gets close. If they explode when the face that's towards you is \n\tsmiling, you'll get a Piece of Heart and some rupees. It can take awhile and \n\tis very frustrating, so don't feel like you're the only one."
      }
    ]
  },
  {
    "title": "Death Mountain Crater",
    "pieces": [
      {
        "number": 6,
        "img": "Zelda05/HeartPieces/HP06.jpg",
        "directions": "\n\tThe wall that leads up to the large area at the entrance of Death Mountain \n\tCrater is climbable and it has an alcove with a Piece of Heart in it. \n\tThere's two ways you can get it:\n\t1) You can enter DMC as a child and runn straight forward. When you hit the \n\tledge, rather than jumping, Link will turn around and start climbing down. \n\tGet to the alcove and claim your prize, then quickly leave before you run \n\tout of time (the limit is based on the amount of Heart Containers you have, \n\tso the more health the better). You can always use this method as an adult \n\tas well.\n\t2) The other way is to plant a Magic Bean here as a child and ride the Magic \n\tBean Plant as an adult. It'll eventually take you over to the alcove."
      },
      {
        "number": 22,
        "img": "Zelda05/HeartPieces/HP22.jpg",
        "directions": "\n\tAs a child, warp to Death Mountain Crater and plant a Magic Bean in the soft \n\tsoil next to the teleport pad. Warp back as an adult and ride the Magic Bean \n\tup to one of the two smoky mountains in the center of the area, which has a \n\tPiece of Heart atop it."
      }
    ]
  },
  {
    "title": "Lake Hylia",
    "pieces": [
      {
        "number": 13,
        "img": "Zelda05/HeartPieces/HP13.jpg",
        "directions": "\n\tIn the Fishing Pond game, catch a 10-pound fish as a child and show it to the man \n\tto get a Piece of Heart."
      },
      {
        "number": 28,
        "img": "Zelda05/HeartPieces/HP28.jpg",
        "directions": "\n\tOnce you win the Golden Scale from the Fishing Pond, you can enter the \n\tLakeside Laboratory and use it to dive down as far as you can. Link will \n\ttouch the bottom and you'll hear the Zelda chime. Swim back up and speak \n\twith Dr. Mizumi to get a reward."
      },
      {
        "number": 27,
        "img": "Zelda05/HeartPieces/HP27.jpg",
        "directions": "\n\tAt the very top of the Lakeside Laboratory is a Piece of Heart. To get up \n\tthere, you can either plant a Magic Bean as a child and ride it as an adult \n\tor use the Scarecrow's Song and Hookshot up. Watch out for the Guays (crows) \n\twhile you're at it too."
      }
    ]
  },
  {
    "title": "Zora's River",
    "pieces": [
      {
        "number": 10,
        "img": "Zelda05/HeartPieces/HP10.jpg",
        "directions": "\n\tThere's a pillar in the middle of the Zora's River area in the water that \n\thas a Piece of Heart atop it. There's a few different ways to get to it:\n\t1) You can bring the Cucco from the beginning of the area, jump at the \n\tnearby platform and let go of the chicken at the last moment to grab on, \n\tpull yourself up and jump to the Piece of Heart.\n\t2) Use the Boomerang as a child to retrieve it.\n\t3) Use the Hover Boots as an adult to float over and grab it."
      },
      {
        "number": 11,
        "img": "Zelda05/HeartPieces/HP11.jpg",
        "directions": "\n\tAt the end of Zora's River, near the entrance to Zora's Domain is a platform \n\tin the corner with a Piece of Heart. There's a few ways to get it:\n\t1) Bring the Cucco from the beginning of the area, throwing it up ledges and \n\tquickly grabbing it before it can touch water and fly off. Get to the \n\thighest point near the platform, jump to it, let go of the Cucco at the last \n\tmoment to grab onto the ledge, snag the prize.\n\t2) Use the Boomerang.\n\t3) Use the Hover Boots."
      },
      {
        "number": 31,
        "img": "Zelda05/HeartPieces/HP31.jpg",
        "directions": "\n\tIn the middle of Zora's Domain, there's some odd looking branches in the \n\twater along with some frogs. Stand on the flat, stumpy part of the logs and \n\tit'll say \"some frogs are looking at you from under the water.\" Pull out \n\tyour Ocarina to make five frogs come out, who mimic your Ocarina playing. \n\tPlay the Song of Storms to make them very excited and give you a Piece of \n\tHeart."
      },
      {
        "number": 32,
        "img": "Zelda05/HeartPieces/HP32.jpg",
        "directions": "\n\tAfter getting Piece of Heart #31 from the frogs, play all of the other \n\tregular (non teleporting) songs to make each frog grow. Once all of them are \n\tgrown, they'll let you play a little bug-catching game. Play the button they \n\trepresent when the butterfly is hovering over them to make them eat it. You \n\tonly have a limited amount of time, so you have to be quick. Luckily, the \n\tpattern isn't random:\n\tA, C-Left, C-Right, C-Down, C-Left, C-Right, C-Down, A, C-Down, A, C-Down, \n\tC-Right, C-Left, A.\n\tThe frogs will reward you with a Piece of Heart."
      }
    ]
  },
  {
    "title": "Zora's Domain",
    "pieces": [
      {
        "number": 12,
        "img": "Zelda05/HeartPieces/HP12.jpg",
        "directions": "\n\tThere are five unlit torches in Zora's Domain.\n\t1) As a child, run up to the throne room and light a Deku Stick, then run \n\tdown the stairs and light the torch you find at the corner. This one will \n\tstay lit.\n\t2) Get out a new Deku Stick so you have the most time and start spiraling \n\tdown the ramp.\n\t3) Next to the shop is another torch, continue on into the water.\n\t4) In the northern corner is a torch next to a circle of stones. Light it \n\tthen quickly head to the waterfall.\n\t5) The final two torches are behind the waterfall. Stay close to the edge, \n\trun inside and light them to make a large chest appear."
      }
    ]
  },
  {
    "title": "Zora's Fountain",
    "pieces": [
      {
        "number": 23,
        "img": "Zelda05/HeartPieces/HP23.jpg",
        "directions": "\n\tWhen you return to Zora's Domain as an adult, Jabu-Jabu is no longer here \n\tand there are no a bunch of icebergs floating around. Jump across them to \n\tfind a Piece of Heart atop one of them."
      },
      {
        "number": 25,
        "img": "Zelda05/HeartPieces/HP25.jpg",
        "directions": "\n\tOnce you have the Iron Boots and Zora's Tunic (that you can get by melting \n\tthe Red Ice encasing King Zora) sink down to the bottom of Zora's Fountain \n\tto find a Piece of Heart in the center."
      }
    ]
  },
  {
    "title": "Ice Cavern",
    "pieces": [
      {
        "number": 24,
        "img": "Zelda05/HeartPieces/HP24.jpg",
        "directions": "\n\tIn the far right room with Blue Fire, lots of stalactites that fall from the \n\tceiling and some patches of Red Ice, there's a Piece of Heart encased in Red \n\tIce to the north. Use Blue Fire to melt it."
      }
    ]
  },
  {
    "title": "Gerudo Valley",
    "pieces": [
      {
        "number": 16,
        "img": "Zelda05/HeartPieces/HP16.jpg",
        "directions": "\n\tIn Gerudo Valley, there's the giant waterfall to the north. In the center of \n\tthe waterfall is an alcove with a Piece of Heart. There's a ladder to get up \n\tthere, so the general idea is to drop down into the water closest to the \n\twaterfall and swim over to the ladder. As a child, you can grab the Cucco \n\tnearby and float over to it. As an adult, you'll probably have more luck \n\tgetting on the \"Gerudo side\" of the bridge and jumping down onto the solid \n\tland, then running over to the higher water and jumping in."
      },
      {
        "number": 17,
        "img": "Zelda05/HeartPieces/HP17.jpg",
        "directions": "\n\tWhen standing on the bridge, if you look towards the \"Gerudo side\" of the \n\tbridge and look off to the left, you'll see a platform up against the wall \n\twith a crate. Roll into the crate to find a Piece of Heart. There's two ways \n\tto get over to this platform:\n\t1) As a child, grab the Cucco and float over to the crate.\n\t2) As an adult, jump down onto the similar platform on the \"Hyrule Field \n\tside,\" then use the Longshot on the crate to get across."
      }
    ]
  },
  {
    "title": "Gerudo Fortress",
    "pieces": [
      {
        "number": 34,
        "img": "Zelda05/HeartPieces/HP34.jpg",
        "directions": "\n\tAt the very top of the fortress is a large treasure chest. One of the doors \n\tto the south takes you to an upper ledge where you can walk around and climb \n\tup some vines to get to the highest point. Run over to the north and at the \n\tgap, you can play the Scarecrow's Song to make Pierre appear. Use the \n\tHookshot to get across and open the chest for a Piece of Heart. If you have \n\tthe Longshot, you should just barely be able to latch onto the chest itself."
      },
      {
        "number": 35,
        "img": "Zelda05/HeartPieces/HP35.jpg",
        "directions": "\n\tOnce you have saved all the carpenters and acquired the Gerudo Membership \n\tCard, you can bring Epona to the far east and play the Gerudo Shooting Range \n\tgame. If you can manage to get over 1,000 Points, she'll gift you with a \n\tPiece of Heart."
      }
    ]
  },
  {
    "title": "Desert Colossus",
    "pieces": [
      {
        "number": 36,
        "img": "Zelda05/HeartPieces/HP36.jpg",
        "directions": "\n\tNext to the entrance of the Spirit Temple is a soft soil location. Plant a \n\tMagic Bean as a child, then come back as an adult and ride it. Near the end \n\tof its travels, it'll go over the Stonehenge-looking platform where there's \n\ta Piece of Heart. Jump off and collect the final one in the game!"
      }
    ]
  }
]
